Notebook.org
#+TITLE: QuarkSuite (v2)
#+PROPERTY: header-args:deno :tangle no
#+PROPERTY: header-args:js :tangle yes :mkdirp yes

* Table of Contents :TOC@4:
- [[#summary][Summary]]
- [[#whats-new-in-v2][What's New in v2?]]
  - [[#workflows][Workflows]]
  - [[#concrete-idioms][Concrete Idioms]]
  - [[#settled-types][Settled Types]]
  - [[#simple-data-rendering][Simple Data Rendering]]
  - [[#wtcg-design-token-spec][WTCG Design Token Spec]]
  - [[#improved-performance][Improved Performance]]
  - [[#internal-simplicity][Internal Simplicity]]
- [[#spec][Spec]]
  - [[#api][API]]
    - [[#functional-utilities][Functional Utilities]]
      - [[#fn_process][fn_process]]
      - [[#fn_preset][fn_preset]]
      - [[#fn_pipeline][fn_pipeline]]
    - [[#color][Color]]
      - [[#color_adjust][color_adjust]]
      - [[#color_mix][color_mix]]
      - [[#color_as_hex][color_as_hex]]
      - [[#color_as_rgb][color_as_rgb]]
      - [[#color_as_hsl][color_as_hsl]]
      - [[#color_as_cmyk][color_as_cmyk]]
      - [[#color_as_hwb][color_as_hwb]]
      - [[#color_as_lab][color_as_lab]]
      - [[#color_as_lch][color_as_lch]]
      - [[#color_as_oklab][color_as_oklab]]
      - [[#color_as_oklch][color_as_oklch]]
      - [[#color_as_dyad][color_as_dyad]]
      - [[#color_as_complementary][color_as_complementary]]
      - [[#color_as_analogous][color_as_analogous]]
      - [[#color_as_split][color_as_split]]
      - [[#color_as_clash][color_as_clash]]
      - [[#color_as_triad][color_as_triad]]
      - [[#color_as_tetrad][color_as_tetrad]]
      - [[#color_as_square][color_as_square]]
      - [[#color_as_star][color_as_star]]
      - [[#color_as_hexagon][color_as_hexagon]]
      - [[#color_as_tints][color_as_tints]]
      - [[#color_as_tones][color_as_tones]]
      - [[#color_as_shades][color_as_shades]]
      - [[#color_as_material][color_as_material]]
      - [[#color_as_blend][color_as_blend]]
      - [[#color_as_interpolation][color_as_interpolation]]
      - [[#color_as_token][color_as_token]]
      - [[#color_as_element][color_as_element]]
      - [[#palette_shift][palette_shift]]
      - [[#palette_sort][palette_sort]]
      - [[#palette_filter][palette_filter]]
      - [[#palette_contrast][palette_contrast]]
      - [[#palette_daltonize][palette_daltonize]]
    - [[#modular-scale][Modular Scale]]
      - [[#ms_create][ms_create]]
      - [[#ms_modify][ms_modify]]
      - [[#ms_split][ms_split]]
      - [[#ms_format][ms_format]]
      - [[#ms_as_tokens][ms_as_tokens]]
      - [[#ms_as_element][ms_as_element]]
    - [[#design-tokens][Design Tokens]]
      - [[#tokens_as_css][tokens_as_css]]
      - [[#tokens_as_scss][tokens_as_scss]]
      - [[#tokens_as_less][tokens_as_less]]
      - [[#tokens_as_styl][tokens_as_styl]]
      - [[#tokens_as_json][tokens_as_json]]
      - [[#tokens_as_yaml][tokens_as_yaml]]
      - [[#tokens_as_gpl][tokens_as_gpl]]
      - [[#tokens_as_sketchpalette][tokens_as_sketchpalette]]
      - [[#tokens_as_tailwind][tokens_as_tailwind]]
      - [[#tokens_as_styledict][tokens_as_styledict]]
      - [[#tokens_as_element][tokens_as_element]]
  - [[#internals][Internals]]
    - [[#functional][Functional]]
      - [[#composition-internals][Composition Internals]]
    - [[#color-1][Color]]
      - [[#tokenization][Tokenization]]
      - [[#validation][Validation]]
      - [[#extraction][Extraction]]
      - [[#parsing][Parsing]]
      - [[#conversion][Conversion]]
      - [[#serialization][Serialization]]
    - [[#modular-scale-internals][Modular Scale Internals]]
    - [[#design-token-internals][Design Token Internals]]

* Summary

This document is my scratchpad/workspace as I further refine QuarkSuite. Literate programming gives me a clear space to
think, iterate, and speculate on different approaches to my ultimate goal of a more enjoyable, flexible, and powerful
design token development environment for web projects.

* What's New in v2?

** Workflows

v1 focused on utilities as the base API and built abstractions (formulas, bootstrappers) on top of it. v2 focuses
*exclusively* on the relationship between types, their available actions, and output emitters.

Rather than providing the factory pattern, I've resolved to /further improve/ the functional workflow.

** Concrete Idioms

Where v1 differentiated between its abstractions with a host of naming conventions, v2 reinforces an idiomatic
relationship between functions and their purpose. The API now follows a simple, explicit naming convention.

+ =type_action(y, x)=: indicates that a function performs an action on =x= with =y= modifying the output
+ =type_as_output(x)=: indicates that a function emits output /directly from/ =x=

** Settled Types

+ =fn=: functional helpers
+ =color=: individual colors (of any valid CSS format)
+ =palette=: generated color palettes
+ =ms=: modular scales
+ =tokens=: token collections

** Simple Data Rendering

After fiddling with a lot of approaches for a UI library, I realized that QuarkSuite doesn't really need a full library
so much as ways to render data to a view. =type_as_element= is a new emitter in v2 that indicates the output will be
HTML rendered or a web component.


** WTCG Design Token Spec

I can transition away from my own Quarks System Dictionary spec in favor of [[https://design-tokens.github.io/community-group/format/][adopting an emerging community spec]]. You
love to see it.

** Improved Performance

The library is already pretty fast, but it could be faster. That in itself is enough for me to research ways to squeeze
a little more performance out of everything happening under the hood.

** Internal Simplicity

Up until now, QuarkSuite used some internal patterns and structure that at the time was some pretty clever code. At the
same time, this makes it a bit /too clever to debug effectively/. I'm being more judicious toward complexity and
limiting it to where it's needed.

* Spec

The library begins with an entry point =mod.js= that aggregates all the functionality to make it easier to experiment
during development before you've settled on what you need. QuarkSuite v2 separates all functionality by its input type.

#+BEGIN_SRC js :tangle "./v2/mod.js" :comments both
// Package all utility types

export * as fn from "./fn.js";
export * as color from "./color.js";
export * as ms from "./ms.js";
export * as tokens from "./tokens.js";
#+END_SRC

** API

The API documentation follows specific formatting that will hopefully make it easier to understand.

#+BEGIN_QUOTE
/Example/:

=name(y, x) => unknown=
+ =y = {}: unknown=: modifier description
+ =x: unknown=: data description
#+END_QUOTE

*** Functional Utilities
:PROPERTIES:
:header-args:js: :tangle "./v2/fn.js" :comments both
:END:

**** fn_process

A functional utility that combines emitters into a process.

+ =fn_process(...emitters) => (x)=
  + =emitters: Array<(x)>=: sequence of emitters to combine

***** fn_process Examples

***** fn_process Implementation

#+BEGIN_SRC js
export function fn_process(...emitters) {
  return compose(...emitters);
}
#+END_SRC

***** fn_process Tests

***** fn_process Errors

**** fn_preset

A functional utility that accepts an action and its modifiers and converts it to an emitter.

+ =fn_preset(action, y) => (x)=
  + =action: (y, x) => unknown=: the action to transform
  + =y: unknown=: the action's associated modifiers

***** fn_preset Examples

***** fn_preset Implementation

#+BEGIN_SRC js
export function fn_preset(action, y) {
  return (x) => action(y, x);
}
#+END_SRC

***** fn_preset Tests

***** fn_preset Errors

**** fn_pipeline

A functional utility that shuttles data =x= through a process pipeline.

+ =fn_pipeline(x, ...processes) => unknown=
  + =x: unknown=: data to pipe
  + =processes: Array<(x)>=: sequence of processes to transform data

***** fn_pipeline Examples

***** fn_pipeline Implementation

#+BEGIN_SRC js
export function fn_pipeline(x, ...processes) {
  return compose(...processes)(x);
}
#+END_SRC

***** fn_pipeline Tests

***** fn_pipeline Errors

*** Color
:PROPERTIES:
:header-args:js: :tangle "./v2/color.js" :comments both
:END:

**** color_adjust

**** color_mix

**** color_as_hex

**** color_as_rgb

**** color_as_hsl

**** color_as_cmyk

**** color_as_hwb

**** color_as_lab

**** color_as_lch

**** color_as_oklab

**** color_as_oklch

**** color_as_dyad

**** color_as_complementary

**** color_as_analogous

**** color_as_split

**** color_as_clash

**** color_as_triad

**** color_as_tetrad

**** color_as_square

**** color_as_star

**** color_as_hexagon

**** color_as_tints

**** color_as_tones

**** color_as_shades

**** color_as_material

**** color_as_blend

**** color_as_interpolation

**** color_as_token

**** color_as_element

**** palette_shift

**** palette_sort

**** palette_filter

**** palette_contrast

**** palette_daltonize

*** Modular Scale
:PROPERTIES:
:header-args:js: :tangle "./v2/ms.js" :comments both
:END:

**** ms_create

**** ms_modify

**** ms_split

**** ms_format

**** ms_as_tokens

**** ms_as_element

*** Design Tokens
:PROPERTIES:
:header-args:js: :tangle "./v2/tokens.js" :comments both
:END:

**** tokens_as_css

**** tokens_as_scss

**** tokens_as_less

**** tokens_as_styl

**** tokens_as_json

**** tokens_as_yaml

**** tokens_as_gpl

**** tokens_as_sketchpalette

**** tokens_as_tailwind

**** tokens_as_styledict

**** tokens_as_element

** Internals

*** Functional
:PROPERTIES:
:header-args:js: :tangle "./v2/fn.js" :comments both
:END:

**** Composition Internals

#+BEGIN_SRC js :tangle "./v2/fn.js"
function compose(...fns) {
  return (x) => fns.reduce((g, f) => f(g), x);
}
#+END_SRC

*** Color
:PROPERTIES:
:header-args:js: :tangle "./v2/color.js" :comments both
:END:

QuarkSuite accepts and processes most valid CSS color formats defined in [[https://www.w3.org/TR/css-color-4/][CSS Color Module Level 4]]. There are no color objects
to pass around, you just use the colors themselves and get colors back.

Under the hood, a sequence of tokenization, validation, extraction, parsing, conversion, and serialization (mostly)
guarantees correct color input /and/ output. So wield those colors with confidence.

**** Tokenization

Color format tokenization follows the spec as closely as possible.

Then we have basic =NUMBER_TOKENS=, a =PERCENTAGE_TOKEN=, tokens for the legacy and modern =DELIMITERS=, a
=COMPONENT_TOKEN= combining the first two, and a =HUE_TOKEN=. That's all that's needed to account for every format
QuarkSuite supports.

#+BEGIN_SRC js
const NUMBER_TOKEN = /(?:-?(?!0\d)\d+(?:\.\d+)?)/;
const PERCENTAGE_TOKEN = new RegExp(
  ["(?:", NUMBER_TOKEN.source, "%)"].join(""),
);

const LEGACY_DELIMITER = /(?:[\s,]+)/;
const LEGACY_ALPHA_DELIMITER = new RegExp(DELIMITER.source.replace(",", ",/"));
const MODERN_DELIMITER = new RegExp(DELIMITER.source.replace(",", ""));
const MODERN_ALPHA_DELIMITER = new RegExp(
  LEGACY_ALPHA_DELIMITER.source.replace(",", ""),
);

const COMPONENT_TOKEN = new RegExp(
  ["(?:", PERCENT_TOKEN.source, "|", NUMBER_TOKEN.source, ")"].join(""),
);
const HUE_TOKEN = new RegExp(
  ["(?:", NUMBER_TOKEN.source, "(?:deg|g?rad|turn)?)"].join(""),
);
#+END_SRC

**** Validation

Defining tokens will make validation of the functional color formats incredibly simple as the tokens can be combined
with the correct format prefix to create a full color string.

