v2/color.js

// Preparing Validation

// From here, we'll implement a =validator()= that accepts input and checks it against all of the available formats. A valid
// color will match /one of/ the available formats and get slotted in a =[format, color]= tuple.


// [[file:../Notebook.org::*Preparing Validation][Preparing Validation:1]]
function validator(input) {
  const SUPPORTED_FORMATS = {
    named: namedValidator,
    hex: hexValidator,
    rgb: rgbValidator,
    hsl: hslValidator,
    cmyk: cmykValidator,
    hwb: hwbValidator,
    cielab: cielabValidator,
    cielch: cielchValidator,
    oklab: oklabValidator,
    oklch: oklchValidator,
  };

  return (
    Object.entries(SUPPORTED_FORMATS)
      .map(([format, test]) => [format, test(input) && input])
      .find(([, color]) => color) || InvalidColor(input)
  );
}
// Preparing Validation:1 ends here

// Invalid Color Handling

// Otherwise, the input does not match any of the available formats and throws a useful error.


// [[file:../Notebook.org::*Invalid Color Handling][Invalid Color Handling:1]]
class InvalidColor extends Error {
  constructor(input, ...params) {
    super(...params);

    // Stack trace (for v8)
    if (Error.captureStackTrace) {
      Error.captureStackTrace(this, InvalidColor);
    }

    this.name = "Invalid Color Format";
    this.msg = `
${input} is not a valid color.
${"-".repeat(100)}

Supported color formats:

- RGB Hex
- Functional RGB
- Functional HSL
- Functional CMYK
- Functional HWB
- Functional CIELAB/CIELCH
- Functional OKLab/OKLCH

Read more about these formats at: https://www.w3.org/TR/css-color-4/
${"=".repeat(100)}
`;
  }
}
// Invalid Color Handling:1 ends here

// RGB Hex Extractor

// For RGB Hex extraction, we need to consider that RGB colors can also come in the form =#RGB(A)=. So we'll use =expandHex()= to expand
// those to a full =#RRGGBB(AA)=. And then we have =hexExtractor()= to do the extraction proper.


// [[file:../Notebook.org::*RGB Hex Extractor][RGB Hex Extractor:1]]
function hexExtractor(color) {
  return expandHex(color).match(/[\da-f]{2}/gi);
}

function expandHex(color) {
  const [, ...values] = color;

  if (values.length === 3 || values.length === 4) {
    return `#${values.map((channel) => channel.repeat(2)).join("")}`;
  }

  return color;
}
// RGB Hex Extractor:1 ends here

// Functional Format Extractor

// Extracting from functional formats requires that the values be picked /with their units attached/. We'll need this
// information for parsing them prior to format conversion.

// This is done with =componentExtractor()=.


// [[file:../Notebook.org::*Functional Format Extractor][Functional Format Extractor:1]]
function componentExtractor(color) {
  return color.match(/(-?[\d.](%|deg|g?rad|turn)?)+/g);
}
// Functional Format Extractor:1 ends here

// Extraction Preparation

// Now with all the parts in place, we'll create a general =extractor()= that consumes a valid color tuple. If the =format=
// is =hex=, we'll call =hexExtractor()=, otherwise it's a functional format and must be handled by =componentExtractor()=.

// We also need to do additional work if the =format= is =named=, so we pass its value in =NAMED_COLOR_KEYWORDS= through
// =hexExtractor()=.

// Note that we're also passing the extraction along in the =[format, components]= tuple form for additional parsing.


// [[file:../Notebook.org::*Extraction Preparation][Extraction Preparation:1]]
function extractor(validated) {
  const [format, color] = validated;

  if (format === "named") {
    return ["hex", hexExtractor(NAMED_COLOR_KEYWORDS[color])];
  }

  if (format === "hex") {
    return ["hex", hexExtractor(color)];
  }

  return [format, componentExtractor(color)];
}
// Extraction Preparation:1 ends here

// Clamping Values

// Before anything else, we'll need a helper to =clamp()= values between a =min= and =max=. Some values in functional
// formats are capped, and others are not. We'll see which when we implement the serializer.


// [[file:../Notebook.org::*Clamping Values][Clamping Values:1]]
function clamp(x, a, b) {
  if (x < a) {
    return a;
  }

  if (x > b) {
    return b;
  }

  return x;
}
// Clamping Values:1 ends here

// Hex Fragment <-> Channel

// Now, we're going to need to convert hex fragments to and from their RGB channel equivalents.

// =16= is the /radix/ (or base) of hexadecimal, so we use =parseInt()= to convert the hex value to a decimal and
// =toString()= to convert a decimal to hexadecimal.


// [[file:../Notebook.org::*Hex Fragment <-> Channel][Hex Fragment <-> Channel:1]]
function hexFragmentToChannel(hex) {
  return parseInt(hex, 16);
}

function hexFragmentFromChannel(channel) {
  return channel.toString(16).padStart(2, "0");
}
// Hex Fragment <-> Channel:1 ends here

// Number <-> Percentage

// Some functional formats will need to have their numbers converted to percentages or the reverse.


// [[file:../Notebook.org::*Number <-> Percentage][Number <-> Percentage:1]]
function numberToPercentage(n) {
  return n * 100;
}

function numberFromPercentage(percentage) {
  return percentage / 100;
}
// Number <-> Percentage:1 ends here

// Number <-> Channel

// RGB channels need to be converted to a =0-1= range to be useful in calculation. And then they need to be converted back
// to channels later.


// [[file:../Notebook.org::*Number <-> Channel][Number <-> Channel:1]]
function numberToChannel(n) {
  return n * 255;
}

function numberFromChannel(channel) {
  return channel / 255;
}
// Number <-> Channel:1 ends here

// Hue Component

// Some of the color conversions require the [[https://www.rapidtables.com/convert/number/how-degrees-to-radians.html][hue as radians]]. And then we need to be able to [[https://www.rapidtables.com/convert/number/how-radians-to-degrees.html][convert back]].

// The hue component also supports gradians and rotations, so we'll have to account for those as well to stay true to the
// spec.


// [[file:../Notebook.org::*Hue Component][Hue Component:1]]
function radiansToDegrees(radians) {
  return (radians * 180) / Math.PI;
}

function radiansFromDegrees(degrees) {
  return (degrees * Math.PI) / 180;
}

function gradiansToDegrees(gradians) {
  return gradians * (180 / 200);
}

function turnsToDegrees(turns) {
  return turns * 360;
}
// Hue Component:1 ends here

// Hue Correction

// A stipulation of the hue component in the spec is that it must support hue values greater than a single revolution.

// However, if it's to be useful in calculation, we must then /correct/ the value to a range =-360-360= or one full
// rotation clockwise and counterclockwise. Our implmentation of =hueCorrection()= takes care of that.


// [[file:../Notebook.org::*Hue Correction][Hue Correction:1]]
function hueCorrection(hue) {
  let h = hue;

  if (Math.sign(hue) === -1) {
    h = Math.abs(hue + 360);
  }

  if (hue > 360) {
    h = hue % 360;
  }

  return clamp(h, -360, 360);
}
// Hue Correction:1 ends here

// Parsing RGB Hex

// RGB Hex must be parsed as RGB channels to be mathematically useful. That's what =parseHex()= does.

// If =A= is missing, then we attach it to ensure uniformity. Finally, we convert the hex fragments to RGB. The alpha
// component needs additional handling.


// [[file:../Notebook.org::*Parsing RGB Hex][Parsing RGB Hex:1]]
function parseHex([format, components]) {
  const [r, g, b, A] = components;

  const [R, G, B] = [r, g, b].map((fragment) =>
    hexFragmentToChannel(parseFloat(fragment))
  );

  if (A) {
    return [
      format,
      [R, G, B, numberFromChannel(hexFragmentToChannel(parseFloat(A)))],
    ];
  }

  return [format, [R, G, B, 1]];
}
// Parsing RGB Hex:1 ends here
