Notebook.org
***** Parsing Functional RGB

As stated above, RGB must be converted to a =0-1= range to be mathematically useful. This is a straightforward
conversion because of our =numberFromChannel()= helper. Meanwhile, percentage values are valid for =a=.

We check to see if =a= is a percentage value and convert it or leave it alone.

This is an operation we'll repeat multiple times during parsing, so it's captured in a =parsePercentage()= helper.

#+BEGIN_SRC js
function parsePercentage(component) {
  if (component.endsWith("%")) {
    return numberFromPercentage(parseFloat(component));
  }
  return parseFloat(component);
}

function parseRgb([format, components]) {
  const [r, g, b, A] = components;

  const [R, G, B] = [r, g, b].map((channel) => {
    if (channel.endsWith("%")) return parsePercentage(channel);
    return numberFromChannel(parseFloat(channel));
  });

  if (A) {
    return [format, [R, G, B, parsePercentage(A)]];
  }

  return [format, [R, G, B, 1]];
}
#+END_SRC

***** Parsing Functional HSL

The =h= component will need special processing depending on its units. And our conversion goal is /degrees/. Other than
that, =s= and =l= need conversion to a =0-1= range, and =A= is handled as usual.

Several formats beyond this point have a hue value, so we'll create a =parseHue()= helper to capture that logic.

#+BEGIN_SRC js
function parseHue(hue) {
  let HUE = parseFloat(hue);

  if (hue.endsWith("rad")) {
    HUE = radiansToDegrees(HUE);
  }

  if (hue.endsWith("grad")) {
    HUE = gradiansToDegrees(HUE);
  }

  if (hue.endsWith("turn")) {
    HUE = turnsToDegrees(HUE);
  }

  return hueCorrection(HUE);
}

function parseHsl([format, components]) {
  const [h, s, l, A] = components;

  let H = parseHue(h);

  const [S, L] = [s, l].map((percentage) =>
    numberFromPercentage(parseFloat(percentage))
  );

  if (A) {
    return [format, [H, S, L, parsePercentage(A)]];
  }

  return [format, [H, S, L, 1]];
}
#+END_SRC

***** Parsing Functional CMYK

Functional CMYK is dead simple to parse. We check to see if the components are percentages and convert them. Otherwise,
we coerce them to numbers with no additional processing.

#+BEGIN_SRC js
function parseCMYK([format, components]) {
  const [C, M, Y, K, A] = components.map((V) => {
    if (V.endsWith("%")) return parsePercentage(V);
    return parseFloat(V);
  });

  if (A) {
    return [format, [C, M, Y, K, A]];
  }

  return [format, [C, M, Y, K, 1]];
}
#+END_SRC

***** Parsing Functional HWB

Parsing functional HWB simply reuses =parseHSL()= because in this area they are /identical/.

***** Parsing Functional CIELAB/CIELCH

Of these two, the only one that requires any special attention is CIELCH because of that hue component. CIELAB just
passes its values through number coercion.

#+BEGIN_SRC js
function parseCielab([format, components]) {
  const [$L, $a, $b, A] = components;

  const [L, a, b] = [$L, $a, $b].map((component) => parseFloat(component));

  if (A) {
    return [format, [L, a, b, parsePercentage(A)]];
  }

  return [[L, a, b, 1]];
}

function parseCielch([format, components]) {
  const [$L, c, h, A] = components;

  const [L, C] = [$L, c].map((component) => parseFloat(component));
  const H = parseHue(h);

  if (A) {
    return [format, [L, C, H, parsePercentage(A)]];
  }

  return [L, C, H, 1];
}
#+END_SRC

***** Parsing OKLab/OKLCH

Parsing OKLab/OKLCH is similar to the above section, but it's important to note that OKLCH calculations expect the hue
in /radians/. =L= is also converted to a =0-1= range.

#+BEGIN_SRC js
function parseOklab([format, components]) {
  const [$L, $a, $b, A] = components;

  const L = parsePercentage($L);
  const [a, b] = [$a, $b].map((component) => parseFloat(component));

  if (A) {
    return [format, [L, a, b, parsePercentage(A)]];
  }

  return [format, [L, a, b, 1]];
}

function parseOklch([format, components]) {
  const [$L, c, h, A] = components;

  const L = parsePercentage($L);
  const C = parseFloat(c);
  const H = radiansFromDegrees(parseHue(h));

  if (A) {
    return [format, [L, C, H, parsePercentage(A)]];
  }

  return [format, [L, C, H, 1]];
}
#+END_SRC

***** Parsing Preparation

Similar to the validator and extractor, the =parser()= will read a color tuple and execute the correct parsing function
for a matched format. And then it throws back a transformed tuple of =[format, values]=.

#+BEGIN_SRC js
function parser(extracted) {
  const [format] = extracted;

  const FORMAT_PARSERS = {
    hex: parseHex,
    rgb: parseRgb,
    hsl: parseHsl,
    cmyk: parseCMYK,
    hwb: parseHsl, // identical to HSL
    cielab: parseCielab,
    cielch: parseCielch,
    oklab: parseOklab,
    oklch: parseOklch,
  };

  return FORMAT_PARSERS[format](extracted);
}
#+END_SRC

**** Conversion

Having completed our necessary preparations, we can finally move on to color conversion. QuarkSuite handles conversion
with a very precise method.

The idea: as a tool created for the web, and therefore largely for screens, every color used will eventually have to
pass through the sRGB gamut. This means that sRGB is our given /conversion anchor/.

With this in mind we can say color conversion is best structured as a pipeline where =INPUT -> RGB -> OUTPUT= routes
every input format to its targeted output format.

****** Preamble

To keep things simple, I'll keep using the color tuple data structure up until the point it's actually time to hand a
color back to the user. This is a *major* change from v1, where I attempted to reassemble the color within each conversion
function which sometimes led to wonky behavior from the pipeline.

It makes far more sense to keep passing along the raw conversions to the color tuple for serialization and make
reassembly an explicit, predictable step.

By this point, we're assuming the color has been validated, extracted, and correctly parsed. So we'll be passing

**** Serialization

*** Modular Scale Internals

*** Design Token Internals
